Revit 2027 API
FabricationPart.GetProductListEntryCount Method
 Gets the number of product entries for this part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetProductListEntryCount()
Public Function GetProductListEntryCount As Integer
public:
int GetProductListEntryCount()
member GetProductListEntryCount : unit -> int
Return Value
Int32
 Returns the number of product entries.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace